IvanPerletti/Stm32_TCP/Gmm_Driver_Src/TEth.cpp
    pbuf_free(p);

    ret_err = ERR_OK;
  }

  /* data received when connection already closed */
  else
  {
    /* Acknowledge data reception */
    tcp_recved(tpcb, p->tot_len);
    
		if (p->tot_len) 
		{
			struct pbuf *pBuf = p;
		
			do 
			{
				ETHLAN8720_RxCallback((u8_t *)pBuf->payload, pBuf->len);
				pBuf = pBuf->next;
			} while (pBuf != NULL);
		}
		
    /* free pbuf and do nothing */
    pbuf_free(p);
    ret_err = ERR_OK;
  }
  return ret_err;
}

/**
  * @brief function used to send data
  * @param  tpcb: tcp control block
  * @param  es: pointer on structure of type client containing info on data 
  *             to be sent
  * @retval None 
  */
void tcp_client_send(struct tcp_pcb *tpcb, struct client * es)
{
  struct pbuf *ptr;
  err_t wr_err = ERR_OK;
 
  while ((wr_err == ERR_OK) &&
         (es->p_tx != NULL) && 
         (es->p_tx->len <= tcp_sndbuf(tpcb)))
  {
    
    /* get pointer on pbuf from es structure */
    ptr = es->p_tx;

    /* enqueue data for transmission */
    wr_err = tcp_write(tpcb, ptr->payload, ptr->len, 1);
    
    if (wr_err == ERR_OK)
    { 
      /* continue with next pbuf in chain (if any) */
      es->p_tx = ptr->next;
      
      if(es->p_tx != NULL)
      {
        /* increment reference count for es->p */
        pbuf_ref(es->p_tx);
      }
      
      /* free pbuf: will free pbufs up to es->p (because es->p has a reference count > 0) */
      pbuf_free(ptr);
   }
   else if(wr_err == ERR_MEM)
   {
      /* we are low on memory, try later, defer to poll */
     es->p_tx = ptr;
   }
   else
   {
     /* other problem ?? */
   }
  }
}

/**
  * @brief  This function implements the tcp_poll callback function
  * @param  arg: pointer on argument passed to callback
  * @param  tpcb: tcp connection control block
  * @retval err_t: error code
  */
err_t tcp_client_poll(void *arg, struct tcp_pcb *tpcb)
{
  err_t ret_err;
  struct client *es;

  es = (struct client*)arg;
  if (es != NULL)
  {
    if (es->p_tx != NULL)
    {
      /* there is a remaining pbuf (chain) , try to send data */
      tcp_client_send(tpcb, es);
    }
    else
    {
      /* no remaining pbuf (chain)  */
      if(es->state == ES_CLOSING)
      {
        /* close tcp connection */
        tcp_client_connection_close(tpcb, es);
      }
    }
    ret_err = ERR_OK;
  }
  else
  {
    /* nothing to be done */
    tcp_abort(tpcb);
    ret_err = ERR_ABRT;
  }
  return ret_err;
}

/**
  * @brief  This function implements the tcp_sent LwIP callback (called when ACK
  *         is received from remote host for sent data) 
  * @param  arg: pointer on argument passed to callback
  * @param  tcp_pcb: tcp connection control block
  * @param  len: length of data sent 
  * @retval err_t: returned error code
  */
err_t tcp_client_sent(void *arg, struct tcp_pcb *tpcb, u16_t len)
{
  struct client *es;

  LWIP_UNUSED_ARG(len);

  es = (struct client *)arg;
  
  if(es->p_tx != NULL)
  {
		TEth::nBytesToTx -= len;
		
    /* still got pbufs to send */
    tcp_client_send(tpcb, es);
  }
  else
  {
		TEth::nBytesToTx = 0;
		
    /* if no more data to send and client closed connection*/
    if(es->state == ES_CLOSING)
    	tcp_client_connection_close(tpcb, es);
  }

  return ERR_OK;
}

/**
  * @brief This function is used to close the tcp connection with server
  * @param tpcb: tcp connection control block
  * @param es: pointer on client structure
  * @retval None
  */
void tcp_client_connection_close(struct tcp_pcb *tpcb, struct client * es )
{
  /* remove callbacks */
  tcp_recv(tpcb, NULL);
  tcp_sent(tpcb, NULL);
  tcp_poll(tpcb, NULL,0);

	tcp_client_handle(NULL);
	
  if (es != NULL)
  {
    mem_free(es);
  }

  /* close tcp connection */
  tcp_close(tpcb);
  
	/* remove instances */
	ETHLAN8720_CloseCallBack();
}

/**
  * @brief Function called when TCP connection established
  * @param tpcb: pointer on the connection contol block
  * @param err: when connection correctly established err should be ERR_OK 
  * @retval err_t: returned error 
  */
err_t tcp_client_connected(void *arg, struct tcp_pcb *tpcb, err_t err)
{
	struct client *es = NULL;
	
  if (err == ERR_OK)   
  {
    /* allocate structure es to maintain tcp connection informations */
    es = (struct client *)mem_malloc(sizeof(struct client));
  
    if (es != NULL)
    {
      es->state = ES_CONNECTED;
      es->pcb = tpcb;
      es->retries = 0;
      es->p_tx = NULL;      
         
			/* pass newly allocated es structure as argument to tpcb */
			tcp_arg(tpcb, es);

			/* initialize LwIP tcp_recv callback function */ 
			tcp_recv(tpcb, tcp_client_recv);

			/* initialize LwIP tcp_sent callback function */
			tcp_sent(tpcb, tcp_client_sent);

			/* initialize LwIP tcp_poll callback function */
			tcp_poll(tpcb, tcp_client_poll, 1);    

			/* initialize LwIP tcp_err callback function */
			tcp_err(tpcb, tcp_client_err);
			
	    /* handle the TCP data */
	    tcp_client_handle(es);
			
      return ERR_OK;
    }
    else
    {
      /* close connection */
      tcp_client_connection_close(tpcb, es);
      
      /* return memory allocation error */
      return ERR_MEM;  
    }
  }
  else
  {
    /* close connection */
    tcp_client_connection_close(tpcb, es);
  }
  return err;
}
    

//----Class Methods------------------------------------------------------------------------
/**
 * @brief Class constructor: declare and *basic* initialization of the USART
 * @param num		number of the port to initialize. See usartSetup struct for details
 */
TEth::TEth()
{
	cleanAllLocalVariables();
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Class Destructor: reset *basic* initialization of the class
 */
TEth::~TEth() 
{
	cleanAllLocalVariables();
}
//-----------------------------------------------------------------------------------------
/**
 @brief Clean all the local variables\n
  unsigned char structPtr,  pointer to this class: need in the Interrupt routine
  char stpIndex, Usart struct setup index: my differ from usartID; (-1) if not found
  char usartID,  name of the USART# / UART#
  USART_TypeDef* USARTPORT,		USART address according to STM32F4 libraries
 *TO-READ parameters*
  - int rx_head, 1st  Not-Already *READ* char ptr in RxCircBuffer
  - int rx_tail, Last Not-Already *READ* char ptr in RxCircBuffer
  - volatile char bCircArrRx[RXBUFFERSIZE],	< circular buffer for RX msg
 *TO-SEND parameters*
  - int tx_head, 1st  Not-Already *SENT* char ptr in TxCircBuffer
  - int tx_tail, Last Not-Already *SENT* char ptr in TxCircBuffer
  - volatile char bCircArrTx[RXBUFFERSIZE];
 */
void  TEth::cleanAllLocalVariables(void)
{
	nBytesToTx = 0;
	
	local_ip.addr = 0;
	server_ip.addr = 0;
	server_port = 0;
	
