IvanPerletti/Stm32_TCP/Gmm_Driver_Src/TEth.cpp
  /* Get Ethernet link status*/
  if(ETH_ReadPHYRegister(ETH_PHY_ADDRESS, PHY_BSR) & 0x4)
  {
    EthStatus |= ETH_LINK_FLAG;
  }

	return(0x00);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Configure the Nested Vectored Interrupt Controller (NVIC)
 * @retval Error number - see USART_Init
 */
unsigned char TEth::NVIC_StructConfig(void)
{
	return(0x00);
}

//-----------------------------------------------------------------------------------------
//##################################################			PUBLIC FUNCTIONS
//-----------------------------------------------------------------------------------------
/**
 * @brief ETH Full Initialization
 * @retval Error code bits:
			- &=0x01 - invalid number: there is no such a ETH configuration;
			- &=0x02 - RCC System Clocks Configuration error
			- &=0x04 - GPIO Configuration error
			- &=0x08 - ETH_Struct Configuration error
			- &=0x10 - Nested VEctor Interrupt Routine error
 */
unsigned char TEth::setup_HW(void)
{
	unsigned char error = 0x00;

  /* Reset ETHERNET on AHB Bus */
  ETH_DeInit();
	
	error |= RCC_Configuration();/*!< System Clocks Configuration */
	error |= GPIO_Config();/*!< GPIO Configuration */
	error |= ETH_StructConfig();/*!< stpIndex configuration */
	error |= NVIC_StructConfig();/*!< Nested VEctor Interrupt Routine*/

	return (error);
}

//-----------------------------------------------------------------------------------------
/**
 * @brief Open the chosed port
 * @return Error code (see TEth::setup_HW(void) )
 * @pre USE TEth::setupCOM() before calling open() function: otherwise default setup is loaded
 * @remark  do not use other ASSERT for USART_InitStructure: parameters can be 0x00
 */
int TEth::open(void)
{
	int error = 0;

	if (local_ip.addr == 0 || server_ip.addr == 0 || server_port == 0)
	{
		error |= 0x01;
	}
	else 
	{
	error = setup_HW();

	if (error == 0) 
	{
		/* Initializes the dynamic memory heap defined by MEM_SIZE.*/
		mem_init();

		/* Initializes the memory pools defined by MEMP_NUM_x.*/
		memp_init();
		
		/* - netif_add(struct netif *netif, struct ip_addr *ipaddr,
		struct ip_addr *netmask, struct ip_addr *gw,
		void *state, err_t (* init)(struct netif *netif),
		err_t (* input)(struct pbuf *p, struct netif *netif))

		Adds your network interface to the netif_list. Allocate a struct
		netif and pass a pointer to this structure as the first argument.
		Give pointers to cleared ip_addr structures when using DHCP,
		or fill them with sane numbers otherwise. The state pointer may be NULL.

		The init function pointer must point to a initialization function for
		your ethernet netif interface. The following code illustrates it's use.*/
		netif_add(&gnetif, &local_ip, &netmask, &gateway, NULL, &ethernetif_init, &ethernet_input);

		/*  Registers the default network interface.*/
		netif_set_default(&gnetif);

		if (EthStatus == (ETH_INIT_FLAG | ETH_LINK_FLAG))
		{ 
			/* Set Ethernet link flag */
			gnetif.flags |= NETIF_FLAG_LINK_UP;

			/* When the netif is fully configured this function must be called.*/
			netif_set_up(&gnetif);

			EthLinkStatus = true;
		}
		else
		{
			/*  When the netif link is down this function must be called.*/
			netif_set_down(&gnetif);

			EthLinkStatus = false;
		}
		
		/* Set the link callback function, this function is called on change of link status*/
		netif_set_link_callback(&gnetif, ETH_link_callback);
	
		/* create new tcp pcb */
		client_pcb = tcp_new();
		
		if (client_pcb != NULL)
			/* connect to destination address/port */
			error = tcp_connect(client_pcb, &server_ip , server_port, tcp_client_connected);
		else
			error = ERR_MEM;
	}
	}
		
	return(error);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Check if the port is open
 * @return port status:
 				- 0x00 if port is closed
  				- 0x01 if port is open
 */
char TEth::isConnected (void)
{
	if (esTx)
		return (esTx->state == ES_CONNECTED && EthLinkStatus);
	return(0x00);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Close the port without de-initializing it. All the RX / TX memory will be erased
 */
void TEth::close (void)
{
	if (isConnected())
		tcp_client_connection_close(esTx->pcb, esTx);
}

void TEth::poll(uint32_t localTime)
{
	uint32_t t = (ETH_ReadPHYRegister(ETH_PHY_ADDRESS, PHY_BSR) & 0x4);
	
	/* If we have link and previous check was not yet */
	if (t && !EthLinkStatus) 
	{
		/* Set link up */
		netif_set_link_up(&gnetif);
	}	
	/* If we don't have link and it was on previous check */
	if (!t && EthLinkStatus) 
	{
		/* Set link down */
		netif_set_link_down(&gnetif);
	}
	
	/* check if any packet received */
	if (ETH_CheckFrameReceived())
	{ 
		/* process received ethernet packet */
		ethernetif_input(&gnetif);
	}
    /* handle periodic timers for LwIP */
#if LWIP_TCP
  /* TCP periodic process every 250 ms */
  if (localTime - TCPTimer >= TCP_TMR_INTERVAL)
  {
    TCPTimer =  localTime;
    tcp_tmr();
  }
#endif

  /* ARP periodic process every 5s */
  if ((localTime - ARPTimer) >= ARP_TMR_INTERVAL)
  {
    ARPTimer =  localTime;
    etharp_tmr();
  }
}

//-----------------------------------------------------------------------------------------
/**
 * @brief Check if there is anything to be transmitted on the serial port
 * @return number of characters to be read
 */
int TEth::bytesToWrite(void)
{
	return nBytesToTx;
}
//-----------------------------------------------------------------------------------------
/**
 * @param msg 		ptr to the message array you want to transmit
 * @param charNum2Send  ptr to the number of char to effectively transmit
 * @return error
				- |=0x01 - message completely sent
				- &=0x01 - Port Not correctly initialized
				- &=0x02 - Too much character to send: stay < RXBUFFERSIZE
 */
unsigned char TEth::write(const char *msg, unsigned short int charNum2Send)
{
	unsigned char error = 0x0;
	
	if (isConnected())
	{
		if (charNum2Send <= sizeof(bArrTx))
		{
			memcpy((void *)bArrTx, (void *)msg, charNum2Send);
			nBytesToTx = charNum2Send;
			
			/* allocate pbuf */
			esTx->p_tx = pbuf_alloc(PBUF_TRANSPORT, charNum2Send , PBUF_POOL);
		 
			if (esTx->p_tx)
			{       
				/* copy data to pbuf */
				pbuf_take(esTx->p_tx, (char*)bArrTx, charNum2Send);

				/* send data */
				tcp_client_send(esTx->pcb, esTx);
			}	
		} 
		else
			error |= 0x02;
	}	
	else
		error |= 0x01;

	return error;
}
